1s/ERP/extensions/liko/Documents/ПересчетТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПересчетТоваров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтборПересчета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПересчетовТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПечататьКоличествоПоУчету</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УчетныеДанныеЗаполнены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЯчейкаКонсолидацииИзлишковТоваров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЯчейкаКонсолидацииИспорченныхТоваров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИспользоватьОтдельнуюЯчейкуИзлишков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИспользоватьОтдельнуюЯчейкуПорчи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>БлокироватьЯчейки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Лико_СкрытаяИнвентаризация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Лико_КонтрольПриемки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Лико_ИтоговаяИнвентаризация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковокФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ИзлишекПорча</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>BRC_ВидКонтактаСПищевойПродукцией</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ВидыКонтактовСПищевойПродукцией</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>BRC_НомерПартииИзготовления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>BRC_УпотребитьДо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>BRC_ДатаПроизводства</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Лико_ЯчейкаФакт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/extensions/liko/AccumulationRegisters/ТоварыВЯчейках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварыВЯчейках</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВНаличии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОтбору</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КРазмещению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

1s/ERP/extensions/liko/Enums/ЯС_ВидыШК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЯС_ВидыШК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ШК_Паллета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ШК_Адреса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ШК_ОбъектаНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ШК_ЗаявкаНаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ШК_ОбъектаНоменклатуры_Короткий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/extensions/liko/Enums/Лико_ТипСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Лико_ТипСклада</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СИМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/extensions/liko/Documents/ПересчетТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
&Вместо("Л_ОбработатьШтрихкоды")
Процедура Расш_Л_ОбработатьШтрихкоды(ДанныеШтрихкода)
	//Элементы.ТекстСообщения.Заголовок="";
	//Если ТекущаяСтрока = Неопределено Тогда
	//	ТекущиеДанные = Неопределено;
	//Иначе
	//	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрока);
	//КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущаяЯчейка) Тогда
		Сообщить("Не заполнена ячейка!");
		
		Возврат;
	КонецЕсли;
	
	Результат = Лико_ДополнительноКлиент.ОбработатьШтрихКодНеТовара(ДанныеШтрихкода[0].Штрихкод);
	Если Результат.ВидШК = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Адреса")
		ИЛИ Результат.ВидШК = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Адреса_Короткий") Тогда
		//Это ячейка
		ТекущаяЯчейка = Результат.АдресаХранения;
	ИначеЕсли Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры_Короткий") Или 
		Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры") Тогда
		
		Если Не ЗначениеЗаполнено(ТекущаяЯчейка) Тогда
			Сообщить("Не заполнена ячейка!");
			Возврат;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Результат.ОбъектНоменклатуры) Тогда
			
			Сообщить("Штрих код не найден! "+ Результат.ШК);
			Возврат;	
		КонецЕсли;
		
		ОбработатьНоменклатуру(Результат);
		
	ИначеЕсли Результат.ВидШК = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Сотрудника") Тогда
		//Это физ. лицо
		АвторДокумента = Результат.Сотрудник;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраница1;
	Иначе
		
		Сообщить("Штрих код не найден! ");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНоменклатуру(Результат) //+Лико m.shenderov 08.12.2017
	
	//СтруктураНоменклатуры= СформироватьСтруктуруНоменклатуры();
	//ПолучитьСтруктуруНоменклатурыСервер(СтруктураНоменклатуры,Результат.ОбъектНоменклатуры);
	//Если ЗначениеЗаполнено(СтруктураНоменклатуры.Номенклатура) Тогда
	Если Не Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Результат.ОбъектНоменклатуры,"Уникальный") Тогда
		ОписаниеОповещение= Новый ОписаниеОповещения("вводКоличестваЗавершение",ЭтаФорма,Результат.ОбъектНоменклатуры);
		
		ПоказатьВводЧисла(ОписаниеОповещение,0,"Введите количество.",15,3);
	Иначе
		ДобавитьРедактироватьСерию(Результат.ОбъектНоменклатуры,Результат.ОбъектНоменклатурыКоличество.Количество); 	
	КонецЕсли;
	
	//
	//СтруктураПоиска = Новый Структура;
	//
	//СтруктураПоиска.Вставить("Серия",Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Результат.ОбъектНоменклатуры,"Серия"));
	//
	//НайденныеСтроки=Объект.Товары.НайтиСтроки(СтруктураПоиска);	
	//
	//
	//Если НайденныеСтроки.Количество()>0  Тогда
	//	НоваяСтрока=НайденныеСтроки[0];
	//	
	//	
	//Иначе
	//	НоваяСтрока=Объект.Товары.Добавить();
	//КонецЕсли;
	//
	//НоваяСтрока.Серия=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Результат.ОбъектНоменклатуры,"Серия");
	//НоваяСтрока.Лико_ЯчейкаФакт=ТекущаяЯчейка;
	//Элементы.Товары.ТекущаяСтрока=НоваяСтрока.ПолучитьИдентификатор();
	//Если Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Результат.ОбъектНоменклатуры,"Уникальный") Тогда
	//	НоваяСтрока.Количество=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Результат.ОбъектНоменклатуры,"Количество");
	//Иначе
	//	Оповещение = Новый ОписаниеОповещения("ПослеВводаКоличества", ЭтотОбъект);
	//	ПоказатьВводЧисла(Оповещение, 1, "Введите количество", 15, 3);
	//	
	//	
	//КонецЕсли;
	////Элементы.Информация.Заголовок=Строка(КоличествоНачалоФакт+Объект.Товары.Количество())+" Из "+Строка(КоличествоВсего) ;	
	//
	//НайтиНоменклатуру=Объект.Товары.НайтиСтроки(СтруктураПоиска);
	//Если    НайтиНоменклатуру.Количество()=0 Тогда
	//	
	//	//Элементы.ТекстСообщения.Заголовок="Штрих-код не входит в отбор!" + Результат.ШК;
	//	
	//	
	//КонецЕсли;
	//
	//
	//
	//Элементы.ВыводКоличества.Заголовок=Строка(Товары.Количество());
	
КонецПроцедуры //-Лико m.shenderov 08.12.2017


Процедура ДобавитьРедактироватьСерию(ОбъектНоменклатуры,Количество) //+Лико m.shenderov 10.01.2018
	//ДокументОбъект=ДокументИнвентаризации.ПолучитьОбъект();
	//ДокТовары=ДокументОбъект.Товары;
	//Для каждого Товар Из Товары Цикл
	Структура = Новый Структура;
	Структура.Вставить("Номенклатура",ОбъектНоменклатуры.Номенклатура);
	Структура.Вставить("Характеристика",ОбъектНоменклатуры.Характеристика);
	Структура.Вставить("Серия",ОбъектНоменклатуры.Серия);
	Структура.Вставить("КоличествоУпаковок",0);
	НайденныеСтроки=Объект.Товары.НайтиСтроки(Структура);
	Для каждого НСтр Из  НайденныеСтроки Цикл
		Объект.Товары.Удалить(НСтр);			
	КонецЦикла;
	
	
	Если  ОбъектНоменклатуры.Уникальный Тогда	
		Структура = Новый Структура;
		Структура.Вставить("Номенклатура",ОбъектНоменклатуры.Номенклатура);
		Структура.Вставить("Характеристика",ОбъектНоменклатуры.Характеристика);
		Структура.Вставить("Серия",ОбъектНоменклатуры.Серия);
		//Структура.Вставить("Ячейка",Товар.Ячейка);
		
		НайденныеСтроки=Объект.Товары.НайтиСтроки(Структура);
		Если  НайденныеСтроки.Количество()>0 Тогда
			СтрокаРедактирования=НайденныеСтроки[0];
			
			СтрокаРедактирования.КоличествоУпаковокФакт	=ОбъектНоменклатуры.Количество; 
			СтрокаРедактирования.КоличествоФакт			=ОбъектНоменклатуры.Количество*ОбъектНоменклатуры.БазоваяЕдиницаИзмерения.Числитель;
			СтрокаРедактирования.Лико_ЯчейкаФакт		=ТекущаяЯчейка;
			
			
		Иначе
			СтрокаРедактирования					=Объект.Добавить();
			СтрокаРедактирования.Номенклатура		=ОбъектНоменклатуры.Номенклатура;
			СтрокаРедактирования.Характеристика		=ОбъектНоменклатуры.Характеристика;
			СтрокаРедактирования.Серия				=ОбъектНоменклатуры.Серия;
			СтрокаРедактирования.Упаковка			=ОбъектНоменклатуры.БазоваяЕдиницаИзмерения;
			СтрокаРедактирования.Лико_ЯчейкаФакт	=ТекущаяЯчейка;
			СтрокаРедактирования.СтатусУказанияСерий=8;
			СтрокаРедактирования.Ячейка         		=ПолучитьАдресХранения(Объект.Дата,Структура);
			
			
			СтрокаРедактирования.КоличествоУпаковокФакт	=ОбъектНоменклатуры.Количество; 
			СтрокаРедактирования.КоличествоФакт			=ОбъектНоменклатуры.Количество*ОбъектНоменклатуры.БазоваяЕдиницаИзмерения.Числитель;
			
			СтрокаРедактирования.КоличествоУпаковок	=СтрокаРедактирования.КоличествоУпаковокФакт; 
			СтрокаРедактирования.Количество			=СтрокаРедактирования.КоличествоФакт; 
		КонецЕсли;	
		СтруктураДействий = Новый Структура;
		
		ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковокФакт(СтруктураДействий);
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаРедактирования, СтруктураДействий, Неопределено);
	Иначе
		
		
		
		
		Структура = Новый Структура;
		Структура.Вставить("Номенклатура",ОбъектНоменклатуры.Номенклатура);
		Структура.Вставить("Характеристика",ОбъектНоменклатуры.Характеристика);
		Структура.Вставить("Серия",ОбъектНоменклатуры.Серия);
		Структура.Вставить("Ячейка",ТекущаяЯчейка);
		
		НайденныеСтроки=Объект.Товары.НайтиСтроки(Структура);
		Если  НайденныеСтроки.Количество()>0 Тогда
			СтрокаРедактирования=НайденныеСтроки[0];
			
			СтрокаРедактирования.КоличествоУпаковокФакт	=Количество; 
			СтрокаРедактирования.КоличествоФакт			=Количество*ОбъектНоменклатуры.БазоваяЕдиницаИзмерения.Числитель;
			СтрокаРедактирования.Лико_ЯчейкаФакт	    =ТекущаяЯчейка;
			
			
			
		Иначе
			СтрокаРедактирования					=Объект.Товары.Добавить();
			СтрокаРедактирования.Номенклатура		=ОбъектНоменклатуры.Номенклатура;
			СтрокаРедактирования.Характеристика		=ОбъектНоменклатуры.Характеристика;
			СтрокаРедактирования.Серия				=ОбъектНоменклатуры.Серия;
			СтрокаРедактирования.Упаковка			=ОбъектНоменклатуры.БазоваяЕдиницаИзмерения;
			СтрокаРедактирования.Лико_ЯчейкаФакт	=ТекущаяЯчейка;
			СтрокаРедактирования.СтатусУказанияСерий=8;									
			СтрокаРедактирования.КоличествоУпаковокФакт	=0; 
			СтрокаРедактирования.КоличествоФакт			=0;
			
		КонецЕсли;
		
		
		СтруктураДействий = Новый Структура;
		
		ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковокФакт(СтруктураДействий);
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаРедактирования, СтруктураДействий, Неопределено);
		
		
	КонецЕсли;	
	
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 10.01.2018

&НаКлиенте
Процедура вводКоличестваЗавершение(Число,Параметры) Экспорт //+Лико m.shenderov 23/01/2020
	Если Число<>Неопределено ТОгда
		ДобавитьРедактироватьСерию(Параметры,Число);
		
		
	КонецЕсли;
	
	
КонецПроцедуры //-Лико m.shenderov 23/01/2020



&НаСервере
Функция ПолучитьАдресХранения(Дата,Структура) //+Лико m.shenderov 26.12.2018  
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТоварыВЯчейкахОстатки.Ячейка КАК Ячейка
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			&Период,
	|			Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика
	|				И Серия = &Серия) КАК ТоварыВЯчейкахОстатки";
	Запрос.УстановитьПараметр("Период",Дата);
	Запрос.УстановитьПараметр("Номенклатура",Структура.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика",Структура.Характеристика);
	Запрос.УстановитьПараметр("Серия",Структура.Серия);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ячейка;
	КонецЦикла; 
	
КонецФункции  //-Лико m.shenderov 26.12.2018

&НаКлиенте
Процедура Лико_ЗаполнитьПосле(Команда)
	Если BRC Тогда
		ЗаполнитьТоварыПоОбъектНоменклатурыНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Лико_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Организация=УправлениеСвойствами.ЗначениеСвойства(ПараметрыСеанса.ТекущийПользователь,"Организация_e4c9d825676549a1a5c19972efa7da0b");
	BRC=?(ЗначениеЗаполнено(Организация),УправлениеСвойствами.ЗначениеСвойства(Организация,"Лико_УчетНаСкладеПоBRC"),Ложь);	
	BRC=Организация=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра;
	
	Если Не BRC Тогда
		ПрослеживаемостьТоваров=  УправлениеСвойствами.ЗначениеСвойства(Организация,"Лико_ПрослеживаемостьТоваров");
	КонецЕсли;
	Если BRC  Тогда
		Элементы.ГруппаBRC.Видимость=Истина;
		//Элементы.ТоварыBRC_ВидКонтактаСПищевойПродукцией.Видимость=Истина;
		//Элементы.ТоварыBRC_НомерПартииИзготовления.Видимость=Истина;
		//Элементы.ТоварыBRC_УпотребитьДо.Видимость=Истина;
		//Элементы.ТоварыBRC_ДатаПроизводства.Видимость=Истина;
	Иначе
		Элементы.ГруппаBRC.Видимость=Ложь;
		
		//Элементы.ТоварыBRC_ВидКонтактаСПищевойПродукцией.Видимость=Ложь;
		//Элементы.ТоварыBRC_НомерПартииИзготовления.Видимость=Ложь;
		//Элементы.ТоварыBRC_УпотребитьДо.Видимость=Ложь;
		//Элементы.ТоварыBRC_ДатаПроизводства.Видимость=Ложь;
		
		
	КонецЕсли;
	
	Если РольДоступна("Лико_ПроведениеСкрытойИнвентаризации") Или РольДоступна("ПолныеПрава")  Тогда
		Элементы.Лико_СкрытаяИнвентаризация.Видимость=Истина;
	Иначе
		Элементы.Лико_СкрытаяИнвентаризация.Видимость=Ложь;

	КонецЕсли;
	
Лико_ЗаполнитьРеквизитыПрослеживаемости();	
КонецПроцедуры

&НаКлиенте
Процедура Лико_ТоварыBRC_ВидКонтактаСПищевойПродукциейПриИзмененииПосле(Элемент)
	ЗаполнитьОбъектНоменклатурыПоТоваруНаСервере(Элементы.Товары.ТекущиеДанные.Серия,
	Элементы.Товары.ТекущиеДанные.BRC_ВидКонтактаСПищевойПродукцией,
	Элементы.Товары.ТекущиеДанные.BRC_НомерПартииИзготовления,
	Элементы.Товары.ТекущиеДанные.BRC_ДатаПроизводства,
	Элементы.Товары.ТекущиеДанные.BRC_УпотребитьДо);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбъектНоменклатурыПоТоваруНаСервере(Серия,BRC_ВидКонтактаСПищевойПродукцией,BRC_НомерПартииИзготовления,BRC_ДатаПроизводства,BRC_УпотребитьДо) //+Лико m.shenderov 15.05.2020
	СпрОбъект=Серия.ЯССМ_ОбъектНоменклатуры.ПолучитьОбъект();	
	СпрОбъект.ВидКонтактаСПищевойПродукцией=BRC_ВидКонтактаСПищевойПродукцией;
	СпрОбъект.НомерПартииИзготовления=BRC_НомерПартииИзготовления;
	СпрОбъект.ДатаПроизводства=BRC_ДатаПроизводства;
	СпрОбъект.УпотребитьДо=BRC_УпотребитьДо;
	СпрОбъект.Записать();
КонецПроцедуры  //-Лико m.shenderov 15.05.2020

&НаСервере
Процедура ЗаполнитьТоварыПоОбъектНоменклатурыНаСервере() //+Лико m.shenderov 15.05.2020
	Для каждого Товар Из Объект.Товары Цикл
		
		
		Товар.BRC_ВидКонтактаСПищевойПродукцией=Товар.Серия.ЯССМ_ОбъектНоменклатуры.ВидКонтактаСПищевойПродукцией;
		Товар.BRC_НомерПартииИзготовления=Товар.Серия.ЯССМ_ОбъектНоменклатуры.НомерПартииИзготовления;;
		Товар.BRC_ДатаПроизводства=Товар.Серия.ЯССМ_ОбъектНоменклатуры.ДатаПроизводства;;
		Товар.BRC_УпотребитьДо=Товар.Серия.ЯССМ_ОбъектНоменклатуры.УпотребитьДо;;
		
	КонецЦикла;
	
КонецПроцедуры  //-Лико m.shenderov 15.05.2020

&НаКлиенте
Процедура Лико_ТоварыBRC_ДатаПроизводстваПриИзмененииПосле(Элемент)
	ТН=Элементы.Товары.ТекущиеДанные;
	СрокКодности=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Элементы.Товары.ТекущиеДанные.Номенклатура,"Лико_СрокГодности");
	Если   ЗначениеЗаполнено(СрокКодности) Тогда
		ТН.BRC_УпотребитьДо=ТН.BRC_ДатаПроизводства+СрокКодности*24*60*60;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Лико_ТоварыКоличествоУпаковокФактПриИзмененииВместо(Элемент)
	ТД=Элементы.Товары.ТекущиеДанные;
	ТД.КоличествоФакт=ТД.КоличествоУпаковокФакт*Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ТД.Упаковка,"Числитель");
КонецПроцедуры

&НаКлиенте
Процедура Лико_ТоварыВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		ТД = Элементы.Товары.ТекущиеДанные;

	Если Поле.Имя="ТоварыПартияПроизводства" Тогда
		Структура=ЗаполнитьСтруктуруДляПартииПроизводстваСервер(ТД.Серия);
		
		Если ЗначениеЗаполнено(Структура) Тогда
			ОписаниеОповещения= Новый ОписаниеОповещения("ТоварыПартияПроизводстваЗавершение",ЭтаФорма);
			ОткрытьФорму("Справочник.ЯССМ_ОбъектыНоменклатуры.Форма.ФормаЭлементаПрослеживаемость",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

 &НаКлиенте
Процедура ТоварыПартияПроизводстваЗавершение(Результат,Параметры)Экспорт  //+Лико m.shenderov 27.03.2023
	
	ТД=Элементы.Товары.ТекущиеДанные;
	
	ТД.ПартияПроизводства=СформироватьИмяПартииСервер(Тд.Номенклатура,Тд.Серия,ПрослеживаемостьТоваров);
	
КонецПроцедуры //-Лико m.shenderov 27.03.2023

&НаСервереБезКонтекста
Функция СформироватьИмяПартииСервер(Номенклатура,Серия,ПрослеживаемостьТоваров) //+Лико m.shenderov 27.03.2023
		Возврат  Справочники.Лико_КонтрольПартийПоризводстваНоменклатуры.СформироватьИмяПартии(Номенклатура,Серия,ПрослеживаемостьТоваров);	
КонецФункции  //-Лико m.shenderov 27.03.2023

 &НаСервереБезКонтекста
Функция ЗаполнитьСтруктуруДляПартииПроизводстваСервер(Серия) //+Лико m.shenderov 27.03.2023
	
	Если ЗначениеЗаполнено(Серия) Тогда
		
		ОН=Серия.ЯССМ_ОбъектНоменклатуры;
		
		Если ОН.Уникальный И ОН.Номенклатура.Лико_КонтрольПартииПроизводстваТовара  Тогда 
			
		Структура = Новый Структура;
		Структура.Вставить("Ключ",Он);
			
		 Возврат Структура;
		
		КонецЕсли;
		
		
	КонецЕсли;
	
	
	
КонецФункции  //-Лико m.shenderov 27.03.2023


&НаСервере
&После("ЗаполнитьСлужебныеРеквизитыПоНоменклатуре")
Процедура Лико_ЗаполнитьСлужебныеРеквизитыПоНоменклатуре()
	Лико_ЗаполнитьРеквизитыПрослеживаемости();
КонецПроцедуры

&НаСервере
Процедура Лико_ЗаполнитьРеквизитыПрослеживаемости() //+Лико m.shenderov 29.03.2023
	
	Если Не ПрослеживаемостьТоваров Тогда
		Возврат;
	КонецЕсли;
	
	Возврат;
	
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		
			
			СтрокаТЧ.ПартияПроизводства=СформироватьИмяПартииСервер(СтрокаТЧ.Номенклатура,СтрокаТЧ.Серия,ПрослеживаемостьТоваров);
			
				
	КонецЦикла;

	
КонецПроцедуры  //-Лико m.shenderov 29.03.2023


&НаКлиенте
Процедура Лико_ПередЗаписьюВместо(Отказ, ПараметрыЗаписи)
	//+ ---> Лико m.shenderov 29.04.2022
	Если Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.Склад,"Лико_ТипСклада")=ПредопределенноеЗначение("Перечисление.Лико_ТипСклада.СИМ")
		Или Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.Склад,"Лико_ТипСклада")=ПредопределенноеЗначение("Перечисление.Лико_ТипСклада.Производство")Тогда
		ВыполняетсяЗапись = Истина;
	КонецЕсли;

	//- <--- Лико m.shenderov 29.04.2022
	
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение
		И Не Объект.УчетныеДанныеЗаполнены 
		И Объект.Товары.Количество() > 0
		И Не Отказ
		И НЕ ВыполняетсяЗапись Тогда
		
		ТекстВопроса = НСтр("ru = 'При проведении будет перезаполнено учетное количество во всех строках табличной части. Продолжить?';
							|en = 'Accounting quantity will be refilled in all rows of the table while posting. Continue?'");
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗаписьюЗавершение", ЭтотОбъект), 
			ТекстВопроса,
			РежимДиалогаВопрос.ОКОтмена,
			,
			КодВозвратаДиалога.ОК);
		Отказ = Истина;
		
	КонецЕсли;
	

КонецПроцедуры


&НаКлиенте
&Вместо("Лико_ПечатьЭтикетокБирок")
Процедура Лико_Лико_ПечатьЭтикетокБирок(Команда)

		
	Для каждого Данные Из ЭтаФорма.Элементы.Товары.ВыделенныеСтроки Цикл 
		ТекДанные = Объект.Товары.НайтиПоИдентификатору(Данные);
		Лико_ДополнительноКлиент.ПечатьЯрлыкаОбъектаНоменклатуры(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ТекДанные.Серия,"ЯССМ_ОбъектНоменклатуры"));
		
	КонецЦикла;

	

КонецПроцедуры
